run/navalFoam/tankSloshing2D/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phase1             water;
phase2             air;

water
{
    transportModel  Newtonian;
    nu              nu [0 2 -1 0 0 0 0] 1e-6;
    rho             rho [1 -3 0 0 0 0 0] 1000;
}

air
{
    transportModel  Newtonian;
    nu              nu [0 2 -1 0 0 0 0] 1.6731e-05;
    rho             rho [1 -3 0 0 0 0 0] 1.1381;
}

// Surface tension not used
sigma           sigma [1 0 -2 0 0 0 0] 0.0;


// ************************************************************************* //
