run/navalFoam/tankSloshing2D/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;

writeFormat         raw;

sampleSets
(
    uniform
    {
        name            cutLine;
        axis            distance;
        start           (0.45 0.001 0);
        end             (0.45 0.5 0);
        nPoints         100;
    }
);

fields
(
    p
);


// ************************************************************************* //
